# Написать программу для расчета 10-процентной торговой комиссий для нескольких продавцов.

# Получить продажи продавца и его ставку в комиссионых.
sales = float(input('Введите объем продаж: '))
comm_rate = float(input('Введите ставку комиссионых: '))

# Рассчитать комиссионное вознаграждение.
commission = sales * comm_rate

# Показать комиссионное вознаграждение
print('Комиссионное вознаграждение составляет $',
      format(commission, '.2f'), sep='')

# Получить продажи еще одного продавца и его ставку комиссионных.
sales = float(input('Введите объем продаж: '))
comm_rate = float(input('Введите ставку комиссионых: '))

# Рассчитать комиссионное вознаграждение.
commission = sales * comm_rate

# Показать комиссионное вознаграждение
print('Комиссионное вознаграждение составляет $',
      format(commission, '.2f'), sep='')

# Получить продажи еще одного продавца и его ставку комиссионных.
sales = float(input('Введите объем продаж: '))
comm_rate = float(input('Введите ставку комиссионых: '))

# Рассчитать комиссионное вознаграждение.
commission = sales * comm_rate

# Показать комиссионное вознаграждение
print('Комиссионное вознаграждение составляет $',
      format(commission, '.2f'), sep='')

# И так снова и снова