# Программа конвентирует текст в азбуку морзе
MORZE_TUPLE = (('.-', 'А'), ('-..', 'Б'), ('.--', 'В'), ('--.', 'Г'), ('-..', 'Д'), ('.', 'Е'),
                ('...-', 'Ж'), ('--..', 'З'), ('..', 'И'), ('.---', 'Й'), ('-.-', 'К'),
                ('.-..','Л'), ('--', 'М'), ('-.', 'Н'), ('---', 'О'), ('.--.', 'П'),
                ('.-.', 'Р'), ('...', 'С'), ('-', 'Т'), ('..-', 'У'), ('..-.', 'Ф'), ('....', 'Х'), 
                ('-.-.', 'Ц'), ('---.', 'Ч'), ('----', 'Ш'), ('--.-', 'Щ'), ('.--.-.', 'Ъ'),
                ('-.--', 'Ы'), ('-..-', 'Ь'), ('..-..', 'Э'), ('..--', 'Ю'), ('.-.-', 'Я'),
                (' ', ' '), ('--..--', ','), ('.-.-.-', '.'), ('..--..', '?'))


def main():
    user_string = user_input()
    code_morze = get_covertation(user_string)

def user_input():
    string = input('Введите предложение для перевода в морзе: ')
    return string

def get_covertation(user_string):
    morze = []
    for item in user_string:   
        for code, letters in MORZE_TUPLE:
            if item.lower() == letters.lower():
                morze.append(code)
    print(''.join(morze))
        

if __name__ == '__main__':
    main()