# Демонстрация алгоритма Евклида по
# поиску наименьшего общего делителя
# Сложность: O(logn)


def main():
    number1 = 15
    number2 = 10
    print(gcf(number1, number2))


# Функция вычисляет наибольший общий делитель
def gcf(x, y):
    # Если y = 0, то меняем их местами 
    # и решаем задачу далее
    if y == 0:
        x, y = y, x

    # Цикл работает пока не найден делитель
    while y != 0:
        # Меняем значения местами, но на место y ставим остаток от деления x на у
        # когда у = 0, цикл прекращается
        x, y = y, x % y

    # Вернуть делитель
    return x


if __name__ == "__main__":
    main()
