# Алгоритм поиска наименьшего общего делителя
# Сложность: O(n) - т.к числа перебираются линейно


def main():
    number1 = 15
    number2 = 5
    print(gcf(number1, number2))


# Функция вычисляет наибольший общий делитель
def gcf(i1, i2):
    # Создание пустой переменной(накопителя)
    gcf = None

    # Условия для поиска наименьшего из двух чисел
    # это позволяет убрать лишние иттерации
    if i1 > i2:
        # Присваиваем значения переменным
        smaller = i2
    else:
        smaller = i1

    # Перебираем значения в цикле от 1 до наименьшего из двух чисел
    # в итоге будет возвращенно либо 1, значит наименьший делитель найден
    # либо None, значит наименьший делитель не найден
    for i in range(1, smaller + 1):
        if i1 % i == 0 and i2 % i == 0:
            gcf = 1
        return gcf


if __name__ == "__main__":
    main()
