# Вторая версия алгоритма поиска наименьшего общего делителя
# добавленна проверка на наличие нуля среди чисел
# Сложность: O(n) - т.к числа перебираются линейно


def main():
    number1 = 15
    number2 = 5
    print(gcf(number1, number2))


# Функция вычисляет наибольший общий делитель
def gcf(i1, i2):
    # Блок проверки на наличие нуля 
    # среди чисел, если есть возвращается второе число
    if i1 == 0:
        return i2
    if i2 == 0:
        return i1

    # Условия для поиска наименьшего из двух чисел
    # это позволяет убрать лишние иттерации
    if i1 > i2:
        # Присваиваем значения переменным
        smaller = i2
    else:
        smaller = i1

    # Перебираем значения в цикле от 1 до наименьшего из двух чисел
    # в итоге будет возвращенно либо 1, значит наименьший делитель найден
    # либо None, значит наименьший делитель не найден
    for divisor in range(1, smaller + 1):
        if (i1 % divisor == 0) and (i2 % divisor == 0):
            gcf = divisor
        return gcf


if __name__ == "__main__":
    main()
