# Вторая версия алгоритма поиска простых чисел
# (Числа деляться только на себя и 1)
# Сложность: O(n) - т.к он линейный

# Импортируем математический модуль
import math


def main():
    num = 100
    print(is_prime(num))
    print(find_primes(num))


# Определяем функцию, n - край диапазона чисел
def is_prime(n):
    # Циклом перебираем числа от 2 до квадрата n + 1
    # так нужно, т.к простые числа на 1,
    # а не включительно, т.к они деляется сами на себя
    for i in range(2, int(math.sqrt(n)) + 1):
        # В случае если остаток 0 - вернуть ложь
        if n % i == 0:
            return False
        # В остальных случая вернуть правду
        return True


# Функция создает список через list compression 
# и возвращает список простых чисел
def find_primes(n):
    return [i for i in range(2, n) if is_prime(i)]


if __name__ == "__main__":
    main()
