# Алгоритм поиска простых чисел
# (Числа деляться только на себя и 1)
# Сложность: O(n) - т.к он линейный


def main():
    num = 100
    print(is_prime(num))


# Определяем функцию, n - край диапазона чисел
def is_prime(n):
    # Циклом перебираем числа от 2 до n(не включительно)
    # так нужно, т.к простые числа на 1,
    # а не включительно, т.к они деляется сами на себя
    for i in range(2, n):
        # В случае если остаток 0 - вернуть ложь
        if n % i == 0:
            return False
        # В остальных случая вернуть правду
        return True


if __name__ == "__main__":
    main()
