print("Перезагрузите компьютер и попробуйте подключиться")
answer = input("Исправили проблему? ")
if answer == "Да" or answer == "да":
    print("Подключение завершено")
else:
    if answer == "Нет" or answer == "нет":
        print("Перезагрузите маршрутизатор и попробуйте подключиться")
        answer = input("Исправили проблему? ")
        if answer == "Да" or answer == "да":
             print("Подключение завершено")
        else:
            if answer == "Нет" or answer == "нет":
                print("Убедитесь, что кабели между маршрутизатором\n" "и модемом прочно соеденены")
                answer = input("Исправили проблему? ")
                if answer == "Да" or answer == "да":
                    print("Подключение завершено")
                else:
                    if answer == "Нет" or answer == "нет":
                        print("Переместите маршрутизатор на новое место")
                        answer = input("Исправили проблему? ")
                        if answer == "Да" or answer == "да":
                            print("Подключение завершено")
                        else:
                            if answer == "Нет" or answer == "нет":
                                print('Возьмите новый маршрутизатор')