# Выводит гистограмму

import matplotlib.pyplot as plt

def main():
    # Список с координатами Х левого края
    left_edges = [0, 10, 20, 30, 40]

    # Список Y высоты 
    heights =[100, 200, 300, 400, 500]

    # Ширина столбиков
    bar_width = 10

    # Построить гистограмму
    plt.bar(left_edges, heights, bar_width, color=('b', 'r', 'y', 'k', 'g'))

    # Заголовок 
    plt.title('Продажи с разбивкой по годам')

    # Описание метки на оси
    plt.xlabel('Год')
    plt.ylabel('Объем продаж')

    # Настройка меток деления
    plt.xticks([5, 15, 25, 35, 45],
               ["2016", "2017", "2018", "2019", "2020"])
    plt.yticks([0, 100, 200, 300, 400, 500], 
               ["$0m", "$1m", "$2m", "$3m", "$4m", "$5m"])
    
    plt.show()

if __name__ == '__main__':
    main()