# Алгоритм выводит
# Fizz - если число кратно 3
# Buzz - если число кратно 5
# FizzBuzz - если число кратно 3 и 5
# Сложность: O(n) - т.к числа перебираются линейно


def main():
    num = 27
    fizzbuzz(num)


# Функция выявляет числа кратные 3, 5 и 3 и 5 одновременно
def fizzbuzz(n):
    # Перебираем циклом все числа от 1 до переданного
    # числа в функцию
    for i in range(1, n + 1):
        # Блок условий сравнения и соответсвующие им выводы
        if i % 3 == 0 and i % 5 == 0:
            print("FizzBuzz")
        elif i % 3 == 0:
            print("Fizz")
        elif i % 5 == 0:
            print("Buzz")
        else:
            print(i)


if __name__ == "__main__":
    main()
